import React, {useState, useRef} from 'react';  
import {Animated, StyleSheet, TouchableOpacity, Image} from 'react-native';
import profile from '../assets/img/profile.jpg'
import menu from '../assets/icons/menu.png';
import close from '../assets/icons/close.png';
import Drawer from './Drawer';
import { Context } from '../context';

const Layout = ({children }) => {
  const [showMenu, setShowMenu] = useState(false);

  const offsetValue = useRef(new Animated.Value(0)).current;
  const scaleValue = useRef(new Animated.Value(1)).current;
  const closeBtnOffset = useRef(new Animated.Value(0)).current;

  const [gasStations, setGasStations] = useState([
    {id: 1,  title:"Зерноград Экспериментальный поворот на Зерноград, Экспериментальный, Ростовская обл., Россия, 347742", lat: 46.812808, lon: 40.296113, distance: 0},
    {id: 2,  title:"ул. Мехлесхоз, 24, Шахты, Ростовская обл., Россия, 346524", lat: 47.68703, lon: 40.200841, distance: 0},
    {id: 3,  title:"Ростовская обл., г. Шахты, п. Интернациональный, выезд на г. Новошахтинск, М19, 906 км+876м, слева", lat: 47.708722, lon: 40.091386, distance: 0},
    {id: 4,  title:"ул. Карла Маркса, 1а, Чертково, Ростовская обл., Россия, 346000", lat: 49.385027, lon: 40.134012, distance: 0},
    {id: 5,  title:"ул. Победы, 116А, Цимлянск, Ростовская, Россия, 347325", lat: 47.654252, lon: 42.048486, distance: 0},
    {id: 6,  title:"ул. 7-я Линия, 238, Целина, Ростовская обл., Россия, 347760", lat: 46.532167, lon: 41.006389, distance: 0},
    {id: 7,  title:"пл. Марцевский Треугольник, 5, Таганрог, Ростовская обл., Россия, 347936", lat: 47.252189, lon: 38.893511, distance: 0},
    {id: 8,  title:"ул. Дзержинского, 154 корпус 2, Таганрог, Ростовская, Россия, 347931", lat: 47.25273, lon: 38.91848, distance: 0},
    {id: 9,  title:"Ростовская обл., Кущёвский район, М4, 3 км на юг от поворота на Степнянский, слева", lat: 46.787117, lon: 39.667017, distance: 0},
    {id: 10, title:"Ростовская обл., Кущевский р-н, п. Степнянский, М4, 1119км+700м, справа", lat: 46.787951, lon: 39.66543, distance: 0},
    {id: 11, title:"ул. Авилова, 4а, Семикаракорск, Ростовская обл., Россия, 346630", lat: 47.511983, lon: 40.830688, distance: 0},
    {id: 12, title:"ул. Калинина, 430, Семикаракорск, Ростовская обл., Россия, 346630", lat: 47.513165, lon: 40.770693, distance: 0},
    {id: 13, title:"Россия, Ростовская область, Сальский район, Сандата", lat: 46.275042, lon: 39.678998, distance: 0},
    {id: 14, title:"ул. Карла Маркса, 142, Самарское, Ростовская обл., Россия, 346751", lat: 46.937296, lon: 39.707241, distance: 0},
    {id: 15, title:"ул. Шолохова, 2, Сальск, Ростовская обл., Россия, 347634", lat: 46.484927, lon: 41.545658, distance: 0},
    {id: 16, title:"	Трактовая ул., Сальск, Ростовская обл., Россия, 347640", lat: 46.473778, lon: 41.480438, distance: 0},
    {id: 17, title:"ул. Островского, 2, Сальск, Ростовская обл., Россия, 347636", lat: 46.465295, lon: 41.531528, distance: 0},
    {id: 18, title:"ул. Петрожицкого, 2 а, Ростов-на-Дону, Ростовская обл., Россия, 344111", lat: 47.248438, lon: 39.844923, distance: 0},
    {id: 19, title:"ул. Мичурина, 14Г, Родионово-Несветайская, Ростовская, Россия, 346580", lat: 47.609581, lon: 39.713747, distance: 0},
    {id: 20, title:"Лесная ул., 4, Ремонтное, Ростовская обл., Россия, 347480", lat: 46.570987, lon: 43.637009, distance: 0},
    {id: 21, title:"ул. Максима Горького, 9, Овощной, Ростовская обл., Россия, 346750", lat: 47.103828, lon: 39.63938, distance: 0},
    {id: 22, title:"ул. Ростовское ш., 929, Новочеркасск, Ростовская обл., Россия, 346421", lat: 47.4208, lon: 40.0333, distance: 0},
    {id: 23, title:"Харьковское ш., 23, Новочеркасск, Ростовская обл., Россия, 346416", lat: 47.481046, lon: 40.102844, distance: 0},
    {id: 24, title:"ул. Харьковская, 2, Новочеркасск, Ростовская обл., Россия, 346414", lat: 47.452288, lon: 40.103284, distance: 0},
    {id: 25, title:"Баклановский пр., 133, Новочеркасск, Ростовская, Россия, 346421", lat: 47.419638, lon: 40.029888, distance: 0},
    {id: 26, title:"Ростовская обл., Чертковский р-н, п. Нагибин, М4, 780 км, справа", lat: 49.567957, lon: 40.570418, distance: 0},
    {id: 27, title:"218км, M21 (Волгоград - Каменск-Шахтинский - граница с Украиной (на Днепропетровск)), Ростовская область, Россия", lat: 48.361097, lon: 41.783345, distance: 0},
    {id: 28, title:"ул. Халтурина, 312, Морозовск, Ростовская обл., Россия, 347210", lat: 48.359133, lon: 41.778783, distance: 0},
    {id: 29, title:"	ул. Кирова, Морозовск, Ростовская обл., Россия, 347214", lat: 48.33085, lon: 41.822633, distance: 0},
    {id: 30, title:"Автодорога А-260 221-Й Км, Морозовск, Ростовская обл., Россия, 347210", lat: 48.366386, lon: 41.795833, distance: 0},
    {id: 31, title:"Ростовская обл., Красносулинский р-н, х. Михайловка, М4, 965 км, слева", lat: 48.008085, lon: 40.23865, distance: 0},
    {id: 32, title:"Ростовская обл., Красносулинский р-н, х. Михайловка, М4, 965 км, справа", lat: 48.011745, lon: 40.239143, distance: 0},
    {id: 33, title:"Хлебная ул., 1, Милютинская, Ростовская обл., Россия, 347120", lat: 48.623995, lon: 41.659373, distance: 0},
    {id: 34, title:"	Советская ул., 50, Миллерово, Ростовская обл., Россия, 346134", lat: 48.918904, lon: 40.371741, distance: 0},
    {id: 35, title:"Артиллерийская ул., 2, Миллерово, Ростовская обл., Россия, 346132", lat: 48.913122, lon: 40.406363, distance: 0},
    {id: 36, title:"Ростовская область, Миллеровский р-он, хут. Ворошиловка, М4, 854 км, слева", lat: 48.95844, lon: 40.4532, distance: 0},
    {id: 37, title:"Ростовская обл., Неклиновский р-н, с.п. Лакедемоновка, а/д М23, 88 км, слева", lat: 47.187751, lon: 38.61955, distance: 0},
    {id: 38, title:"ул. Дивизии, 4, Константиновск, Ростовская, Россия, 347250", lat: 47.583976, lon: 41.120297, distance: 0},
    {id: 39, title:"ул. Черняховского, 1, Кировская, Ростовская обл., Россия, 347709", lat: 46.968935, lon: 40.058658, distance: 0},
    {id: 40, title:"Южная ул., 2, Кашары, Ростовская, Россия, 346200", lat: 49.020992, lon: 41.000161, distance: 0},
    {id: 41, title:"М-4, Ростовская обл., Россия, 347800", lat: 48.27531, lon: 40.29506, distance: 0},
    {id: 42, title:"Дальний пер., 9, Каменск-Шахтинский, Ростовская обл., Россия, 347803", lat: 48.30749, lon: 40.256647, distance: 0},
    {id: 43, title:"	пер. Кольцовский, 80, Кагальницкая, Ростовская, Россия, 347700", lat: 46.87638, lon: 40.157197, distance: 0},
    {id: 44, title:"Ростовская обл., Багаевский р-н, х. Ёлкин, а/д Ростов-на-Дону - Волгодонск, 63 км, справа", lat: 47.311558, lon: 40.539733, distance: 0},
    {id: 45, title:"Ростовская обл., Егорлыкский р-н, станица Егорлыкская, Р269, 95 км, слева", lat: 46.585228, lon: 40.63346, distance: 0},
    {id: 46, title:"Магистральная ул., 28, Гуково, Ростовская, Россия, 347872", lat: 48.043345, lon: 39.926301, distance: 0},
    {id: 47, title:"пр. Строителей, 1б, Волгодонск, Ростовская обл., Россия, 347371", lat: 47.511574, lon: 42.18875, distance: 0},
    {id: 48, title:"Прибрежная ул., 25, Волгодонск, Ростовская обл., Россия, 347369", lat: 47.50679, lon: 42.17784, distance: 0},
    {id: 49, title:"Промышленный пер., 1, Веселый, Ростовская обл., Россия, 347780", lat: 47.096568, lon: 40.716072, distance: 0},
    {id: 50, title:"ул. Шолохова, 38, Белая Калитва, Ростовская обл., Россия, 347040", lat: 48.196918, lon: 40.777195, distance: 0},
    {id: 51, title:"ул. Коммунистическая, 184, Батайск, Ростовская обл., Россия, 346884", lat: 47.13452, lon: 39.763684, distance: 0},
    {id: 52, title:"ул. Ленина, 168Б, Батайск, Ростовская обл., Россия, 346880", lat: 47.117132, lon: 39.746293, distance: 0},
    {id: 53, title:"Сальское ш., 1, Батайск, Ростовская обл., Россия, 346886", lat: 47.091236, lon: 39.765122, distance: 0},
    {id: 54, title:"Самарское ш., 19, Батайск, Ростовская, Россия, 346886", lat: 47.067849, lon: 39.747752, distance: 0},
    {id: 55, title:"Россия, Ростовская область, Батайск, ул. Куйбышева", lat: 47.154244, lon: 39.736994, distance: 0},
    {id: 56, title:"ул. Будённого, 161А, Багаевская, Ростовская, Россия, 346611", lat: 47.300835, lon: 40.397812, distance: 0},
    {id: 57, title:"Ростовская обл., Красносулинский р-н, п. Аютинский, М4, 993 км + 800м, справа", lat: 47.760791, lon: 40.147991, distance: 0},
    {id: 58, title:"Ростовская обл., Октябрьский р-н, с. Аюта, М4, 1009 км, слева", lat: 47.649063, lon: 40.025114, distance: 0},
    {id: 59, title:"	Ростовская область, Чертковский район, село Алексеево-Лозовское", lat: 49.379132, lon: 40.593796, distance: 0},
    {id: 60, title:"М-4, Алексеево-Лозовское, Ростовская обл., Россия, 346010", lat: 49.384217, lon: 40.584462, distance: 0},
    {id: 61, title:"Аксайский пр., 27, Аксай, Ростовская обл., Россия, 346720", lat: 47.28952, lon: 39.850491, distance: 0},
    {id: 62, title:"Аксайский пр., 4В, Аксай, Ростовская обл., Россия, 344009", lat: 47.271683, lon: 39.825814, distance: 0},
    {id: 63, title:"	ул. Западная, 62Б, Аксай, Ростовская обл., Россия, 346720", lat: 47.284056, lon: 39.849786, distance: 0},
    {id: 64, title:"Кагальницкое ш., 16А, Азов, Ростовская, Россия, 346780", lat: 47.097291, lon: 39.407262, distance: 0},
    {id: 65, title:"	Московская ул., 33А, Азов, Ростовская, Россия, 346783", lat: 47.089783, lon: 39.45464, distance: 0},
    {id: 66, title:"Россия, Ростовская область, г. Каменск-Шахтинский, трасса М4, 934 км, Москва-Краснодар(Дон), справа", lat: 48.27647, lon: 40.29341, distance: 0},
    {id: 67, title:"Ростовская обл., Мясниковский р-н, п. Чалтырь, М23, 9 км, слева", lat: 47.265456, lon: 39.5805, distance: 0},
    {id: 68, title:"Ростовская ул., 47, Чалтырь, Ростовская обл., Россия, 346800", lat: 47.275837, lon: 39.517103, distance: 0},
    {id: 69, title:"просп. 40-Летия Победы, 1 д, Ростов-на-Дону, Ростовская обл., Россия, 344072", lat: 47.235218, lon: 39.795892, distance: 0},
    {id: 70, title:"пер. Боковский, 51, Ростов-на-Дону, Ростовская обл., Россия, 344048", lat: 47.23313, lon: 39.78663, distance: 0},
    {id: 71, title:"	ул. Bити Черевичкина, 102, Ростов-на-Дону, Ростовская обл., Россия, 344025", lat: 47.237098, lon: 39.781108, distance: 0},
    {id: 72, title:"ул. Вятская, 120 б, Ростов-на-Дону, Ростовская обл., Россия, 344065", lat: 47.27835, lon: 39.775308, distance: 0},
    {id: 73, title:"ул. Вятская, 116/3, Ростов-на-Дону, Ростовская обл., Россия, 344065", lat: 47.279884, lon: 39.76774, distance: 0},
    {id: 74, title:"ул. Менжинского, 2Б, Ростов-на-Дону, Ростовская обл., Россия, 344029", lat: 47.259136, lon: 39.765594, distance: 0},
    {id: 75, title:"Россия, Ростов-на-Дону, Кировский район", lat: 47.183172, lon: 39.738911, distance: 0},
    {id: 76, title:"Театральный пр., 62б, Ростов-на-Дону, Ростовская обл., Россия, 344023", lat: 47.2424, lon: 39.734459, distance: 0},
    {id: 77, title:"ул. Штахановского, 28 корпус 1, Ростов-на-Дону, Ростовская, Россия, 344095", lat: 47.292118, lon: 39.733461, distance: 0},
    {id: 78, title:"Пойменная ул., 1Б, Ростов-на-Дону, Ростовская обл., Россия, 344002", lat: 47.203068, lon: 39.728301, distance: 0},
    {id: 79, title:"Красноармейская ул., 105А, Ростов-на-Дону, Ростовская обл., Россия, 344022", lat: 47.231324, lon: 39.726884, distance: 0},
    {id: 80, title:"ул. Орбитальная, 11, Ростов-на-Дону, Ростовская обл., Россия, 344114", lat: 47.302414, lon: 39.722403, distance: 0},
    {id: 81, title:"ул. Волкова, 24, Ростов-на-Дону, Ростовская обл., Россия, 344092", lat: 47.28372, lon: 39.721273, distance: 0},
    {id: 82, title:"Королева Просп., 30Б, Ростов-на-Дону, Ростовская, Россия, 344113", lat: 47.295756, lon: 39.719363, distance: 0},
    {id: 83, title:"пр. Михаила Нагибина, 30В, Ростов-на-Дону, Ростовская обл., Россия, 344068", lat: 47.257709, lon: 39.717035, distance: 0},
    {id: 84, title:"пр. Космонавтов, 1б, Ростов-на-Дону, Ростовская обл., Россия, 344092", lat: 47.278594, lon: 39.716692, distance: 0},
    {id: 85, title:"Бодрая ул., 92, Ростов-на-Дону, Ростовская обл., Россия, 344068", lat: 47.274097, lon: 39.705121, distance: 0},
    {id: 86, title:"ул. Фрунзе, 34, Ростов-на-Дону, Ростовская обл., Россия, 344012", lat: 47.241978, lon: 39.698088, distance: 0},
    {id: 87, title:"просп. Сиверса, 2Д, Ростов-на-Дону, Ростовская обл., Россия, 344050", lat: 47.216934, lon: 39.697246, distance: 0},
    {id: 88, title:"пр. Королева, 5А, Ростов-на-Дону, Ростовская обл., Россия, 344113", lat: 47.293715, lon: 39.696752, distance: 0},
    {id: 89, title:"Привокзальная пл., 3, Ростов-на-Дону, Ростовская обл., Россия, 344001", lat: 47.218508, lon: 39.694314, distance: 0},
    {id: 90, title:"пр. Королева, 1Б, Ростов-на-Дону, Ростовская обл., Россия, 344064", lat: 47.283975, lon: 39.691908, distance: 0},
    {id: 91, title:"ул. Нансена, 81А, Ростов-на-Дону, Ростовская обл., Россия, 344039", lat: 47.246006, lon: 39.686919, distance: 0},
    {id: 92, title:"ул. Вавилова, 67Б, Ростов-на-Дону, Ростовская обл., Россия, 344064", lat: 47.275153, lon: 39.686018, distance: 0},
    {id: 93, title:"	ул. Вавилова, 68 корпус 3, Ростов-на-Дону, Ростовская, Россия, 344064", lat: 47.279167, lon: 39.684717, distance: 0},
    {id: 94, title:"ул. Вавилова, 70Б, Ростов-на-Дону, Ростовская обл., Россия, 344064", lat: 47.281762, lon: 39.684581, distance: 0},
    {id: 95, title:"Профсоюзная ул., 177/58г, Ростов-на-Дону, Ростовская обл., Россия, 344004", lat: 47.2228, lon: 39.6545, distance: 0},
    {id: 96, title:"ул. Всесоюзная, 166, Ростов-на-Дону, Ростовская обл., Россия, 344033", lat: 47.187497, lon: 39.636553, distance: 0},
    {id: 97, title:"ул. Малиновского, 152, Ростов-на-Дону, Ростовская обл., Россия, 344016", lat: 47.249983, lon: 39.614567, distance: 0},
    {id: 98, title:"ул. Малиновского, 32, Ростов-на-Дону, Ростовская обл., Россия, 344090", lat: 47.211486, lon: 39.614286, distance: 0},
    {id: 99, title:"1-й Машиностроительный пер., 1А, Ростов-на-Дону, Ростовская обл., Россия, 344016", lat: 47.2539, lon: 39.613319, distance: 0},
    {id: 100,title:"ул. Малиновского, 7Б, Ростов-на-Дону, Ростовская обл., Россия, 344033",  lat: 47.204205, lon: 39.613191, distance: 0},
    {id: 101,title:"	ул. Малиновского, 29, Ростов-на-Дону, Ростовская обл., Россия, 344015",  lat: 47.231903, lon: 39.613019, distance: 0},
  ]);
  return (
    <Context.Provider value={gasStations}>
    <Drawer/>
    <Animated.View
      style={[
        styles.container,
        {
          transform: [{scale: scaleValue}, {translateX: offsetValue}],
          borderRadius: showMenu ? 15 : 0,
        },
      ]}>
      <TouchableOpacity
        onPress={() => {
          Animated.timing(scaleValue, {
            toValue: showMenu ? 1 : 0.88,
            duration: 300,
            useNativeDriver: true,
          }).start();

          Animated.timing(offsetValue, {
            toValue: showMenu ? 0 : 220,
            duration: 300,
            useNativeDriver: true,
          }).start();

          setShowMenu(!showMenu);
        }}>
        <Image source={showMenu ? close : menu} style={styles.img} />
      </TouchableOpacity>
      {children}
    </Animated.View>
    </Context.Provider>
  );
};

const styles = StyleSheet.create({
  container: {
    flexGrow: 1,
    backgroundColor: '#2e2e2e',
    position: 'absolute',
    top: 0,
    bottom: 0,
    right: 0,
    left: 0,
    paddingHorizontal: 15,
    paddingVertical: 25,
  },
  img: {
    width: 25,
    height: 25,
    tintColor: '#f2f2f2',
  },
});
export default Layout;
